ADHERING TO ACADEMIC INTEGRITY POLICIES

"I certify that the code and data in this assignment were generated independently, 
using only the tools and resources defined in the course and that I did not receive 
any external help, coaching or contributions during the production of this work."

# PART2: PENGUINS Dataset

In [1]:
import sys
import numpy as np
np.set_printoptions(threshold=sys.maxsize) # To print an entire numpy array/matrix if big in size. (not to have truncation)
import random
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
pd.set_option("display.max_rows",400)
pd.set_option("display.max_columns",15)

In [2]:
df3 = pd.read_csv("penguins.csv")
df3.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,male,2007
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,female,2007
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,female,2007
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,2007
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,female,2007

MAIN CHARACTERISTICS AND STATISTICS

In [3]:
print("df3.shape =",df3.shape)

df3.shape = (344, 8)

In [4]:
df3.dtypes

species               object
island                object
bill_length_mm       float64
bill_depth_mm        float64
flipper_length_mm    float64
body_mass_g          float64
sex                   object
year                   int64
dtype: object

Converting the string data types to categorical datatypes

In [5]:
df3['species'] = df3['species'].astype('category')
df3['island'] = df3['island'].astype('category')
df3['sex'] = df3['sex'].astype('category')

In [6]:
df3.dtypes

species              category
island               category
bill_length_mm        float64
bill_depth_mm         float64
flipper_length_mm     float64
body_mass_g           float64
sex                  category
year                    int64
dtype: object

In [7]:
df3.describe()

,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,year
count,342.000000,342.000000,342.000000,342.000000,344.000000
mean,43.921930,17.151170,200.915205,4201.754386,2008.029070
std,5.459584,1.974793,14.061714,801.954536,0.818356
min,32.100000,13.100000,172.000000,2700.000000,2007.000000
25%,39.225000,15.600000,190.000000,3550.000000,2007.000000
50%,44.450000,17.300000,197.000000,4050.000000,2008.000000
75%,48.500000,18.700000,213.000000,4750.000000,2009.000000
max,59.600000,21.500000,231.000000,6300.000000,2009.000000

PRINTING MINIMUM AND MAXIMUM VALUES OF EACH COLUMNS

In [8]:
print("Minimum Value of 'bill length mm' = ",df3.bill_length_mm.min())
print("Maximum Value of 'bill length mm' = ",df3.bill_length_mm.max())
print()
print("Minimum Value of 'bill depth mm' = ",df3.bill_depth_mm.min())
print("Maximum Value of 'bill depthh mm' = ",df3.bill_depth_mm.max())
print()
print("Minimum Value of 'flipper length mm' = ",df3.flipper_length_mm.min())
print("Maximum Value of 'flipper length mm' = ",df3.flipper_length_mm.max())
print()
print("Minimum Value of 'body mass g' = ",df3.body_mass_g.min())
print("Maximum Value of 'body mass g' = ",df3.body_mass_g.max())

Minimum Value of 'bill length mm' =  32.1
Maximum Value of 'bill length mm' =  59.6

Minimum Value of 'bill depth mm' =  13.1
Maximum Value of 'bill depthh mm' =  21.5

Minimum Value of 'flipper length mm' =  172.0
Maximum Value of 'flipper length mm' =  231.0

Minimum Value of 'body mass g' =  2700.0
Maximum Value of 'body mass g' =  6300.0

In [9]:
df3.count()

species              344
island               344
bill_length_mm       342
bill_depth_mm        342
flipper_length_mm    342
body_mass_g          342
sex                  333
year                 344
dtype: int64

In [10]:
df3.nunique()

species                3
island                 3
bill_length_mm       164
bill_depth_mm         80
flipper_length_mm     55
body_mass_g           94
sex                    2
year                   3
dtype: int64

SPECIES

In [11]:
print("Unique_SPECIES =",df3.species.unique())
print()
print(df3.species.value_counts()) # FREQUENCY OF OCCURENCE

Unique_SPECIES = ['Adelie', 'Gentoo', 'Chinstrap']
Categories (3, object): ['Adelie', 'Chinstrap', 'Gentoo']

Adelie       152
Gentoo       124
Chinstrap     68
Name: species, dtype: int64

ISLAND

In [12]:
print("Unique_ISLAND =",df3.island.unique())
print()
print(df3.island.value_counts()) # FREQUENCY OF OCCURENCE

Unique_ISLAND = ['Torgersen', 'Biscoe', 'Dream']
Categories (3, object): ['Biscoe', 'Dream', 'Torgersen']

Biscoe       168
Dream        124
Torgersen     52
Name: island, dtype: int64

SEX

In [13]:
print("Unique_SEX =",df3.sex.unique())
print()
print(df3.sex.value_counts()) # FREQUENCY OF OCCURENCE

Unique_SEX = ['male', 'female', NaN]
Categories (2, object): ['female', 'male']

male      168
female    165
Name: sex, dtype: int64

YEAR

In [14]:
print("Unique_YEAR =",df3.year.unique())
print()
print(df3.year.value_counts()) # FREQUENCY OF OCCURENCE

Unique_YEAR = [2007 2008 2009]

2009    120
2008    114
2007    110
Name: year, dtype: int64

DATA PREPROCESSING

In [15]:
df3['body_mass_g'] = df3['body_mass_g']/1000
df3 = df3.rename(columns={"body_mass_g":"body_mass_kg"})

In [16]:
df3.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_kg,sex,year
0,Adelie,Torgersen,39.1,18.7,181.0,3.75,male,2007
1,Adelie,Torgersen,39.5,17.4,186.0,3.80,female,2007
2,Adelie,Torgersen,40.3,18.0,195.0,3.25,female,2007
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,2007
4,Adelie,Torgersen,36.7,19.3,193.0,3.45,female,2007

In [17]:
df3 = df3.drop(['year'], 1) # THIS FEATURE DOES NOT CONTRIBUTE TO IN ANYWAY

C:\Users\desai\AppData\Local\Temp/ipykernel_2156/1781351594.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only
  df3 = df3.drop(['year'], 1) # THIS FEATURE DOES NOT CONTRIBUTE TO IN ANYWAY

In [18]:
df3.isna().any()

species              False
island               False
bill_length_mm        True
bill_depth_mm         True
flipper_length_mm     True
body_mass_kg          True
sex                   True
dtype: bool

In [19]:
df3.isna().sum()

species               0
island                0
bill_length_mm        2
bill_depth_mm         2
flipper_length_mm     2
body_mass_kg          2
sex                  11
dtype: int64

In [20]:
df3 = df3.dropna() # HENCE WE DROP THE NULL ENTRIES
df3.shape

(333, 7)

In [21]:
df3 = df3.reset_index(drop=True) # This resets the index, an important command
df3.tail()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_kg,sex
328,Chinstrap,Dream,55.8,19.8,207.0,4.000,male
329,Chinstrap,Dream,43.5,18.1,202.0,3.400,female
330,Chinstrap,Dream,49.6,18.2,193.0,3.775,male
331,Chinstrap,Dream,50.8,19.0,210.0,4.100,male
332,Chinstrap,Dream,50.2,18.7,198.0,3.775,female

In [22]:
print("Any duplicate entries =",df3.duplicated().any(axis=0))
print("Total duplicate entries =", df3.duplicated().sum(axis=0))

Any duplicate entries = False
Total duplicate entries = 0

# LOGISTIC REGRESSION MODEL (GENDER PREDICTION)

In [23]:
df3.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_kg,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3.75,male
1,Adelie,Torgersen,39.5,17.4,186.0,3.80,female
2,Adelie,Torgersen,40.3,18.0,195.0,3.25,female
3,Adelie,Torgersen,36.7,19.3,193.0,3.45,female
4,Adelie,Torgersen,39.3,20.6,190.0,3.65,male

In [24]:
df3.shape

(333, 7)

In [25]:
df3.describe()

       bill_length_mm  bill_depth_mm  flipper_length_mm  body_mass_kg
count      333.000000     333.000000         333.000000    333.000000
mean        43.992793      17.164865         200.966967      4.207057
std          5.468668       1.969235          14.015765      0.805216
min         32.100000      13.100000         172.000000      2.700000
25%         39.500000      15.600000         190.000000      3.550000
50%         44.500000      17.300000         197.000000      4.050000
75%         48.600000      18.700000         213.000000      4.775000
max         59.600000      21.500000         231.000000      6.300000

NORMALIZING NON-CATEGORICAL COLUMNS (RESCALING THEM IN THE LIMITS 0 TO 1)

In [26]:
print("Min of bill_length_mm =",df3.bill_length_mm.min())
print("Max of bill_length_mm =",df3.bill_length_mm.max())
print()
print("Min of bill_depth_mm =",df3.bill_depth_mm.min())
print("Max of bill_depth_mm =",df3.bill_depth_mm.max())
print()
print("Min of flipper_length_mm =",df3.flipper_length_mm.min())
print("Max of flipper_length_mm =",df3.flipper_length_mm.max())
print()
print("Min of body_mass_kg =",df3.body_mass_kg.min())
print("Max of body_mass_kg =",df3.body_mass_kg.max())

Min of bill_length_mm = 32.1
Max of bill_length_mm = 59.6

Min of bill_depth_mm = 13.1
Max of bill_depth_mm = 21.5

Min of flipper_length_mm = 172.0
Max of flipper_length_mm = 231.0

Min of body_mass_kg = 2.7
Max of body_mass_kg = 6.3

In [27]:
def maps(feature):
    trial = []
    for val in feature: 
        maps_val = (val/feature.max())*1
        trial.append(maps_val)
    return trial

In [28]:
df3['BL_mm(0-1)'] = maps(df3.bill_length_mm)

In [29]:
df3['BD_mm(0-1)'] = maps(df3.bill_depth_mm)

In [30]:
df3['FL_mm(0-1)'] = maps(df3.flipper_length_mm)

In [31]:
df3['BM_kg(0-1)'] = maps(df3.body_mass_kg)

In [32]:
df3 = df3.drop(["bill_length_mm","bill_depth_mm","flipper_length_mm","body_mass_kg"], axis = 1)

In [33]:
df3.head()

  species     island     sex  BL_mm(0-1)  BD_mm(0-1)  FL_mm(0-1)  BM_kg(0-1)
0  Adelie  Torgersen    male    0.656040    0.869767    0.783550    0.595238
1  Adelie  Torgersen  female    0.662752    0.809302    0.805195    0.603175
2  Adelie  Torgersen  female    0.676174    0.837209    0.844156    0.515873
3  Adelie  Torgersen  female    0.615772    0.897674    0.835498    0.547619
4  Adelie  Torgersen    male    0.659396    0.958140    0.822511    0.579365

In [34]:
df3.describe()

       BL_mm(0-1)  BD_mm(0-1)  FL_mm(0-1)  BM_kg(0-1)
count  333.000000  333.000000  333.000000  333.000000
mean     0.738134    0.798366    0.869987    0.667787
std      0.091756    0.091592    0.060674    0.127812
min      0.538591    0.609302    0.744589    0.428571
25%      0.662752    0.725581    0.822511    0.563492
50%      0.746644    0.804651    0.852814    0.642857
75%      0.815436    0.869767    0.922078    0.757937
max      1.000000    1.000000    1.000000    1.000000

CONVERTING STRING DATATYPES TO CATEGORICAL DATATYPES

In [35]:
def species_CTG(feature):
    species_ctg = []
    for name in feature: 
        if (name == 'Adelie'):
            species_ctg.append(1)
        elif (name == 'Gentoo'):
            species_ctg.append(2)
        elif (name == 'Chinstrap'):
            species_ctg.append(3)
    return species_ctg

In [36]:
df3['species_ctg'] = species_CTG(df3.species)

In [37]:
def island_CTG(feature):
    island_ctg = []
    for name in feature: 
        if (name == 'Biscoe'):
            island_ctg.append(1)
        elif (name == 'Dream'):
            island_ctg.append(2)
        elif (name == 'Torgersen'):
            island_ctg.append(3)
    return island_ctg

In [38]:
df3['island_ctg'] = island_CTG(df3.island)

In [39]:
sex_list = df3['sex'].tolist()

binary_sex = []
for i in sex_list:
    if (i == 'male'):
        binary_sex.append(1)
    elif (i == 'female'):
        binary_sex.append(-1)
binary_sex = pd.DataFrame(binary_sex)

df3['binary_sex'] = binary_sex

MALE = 1

FEMALE = -1

In [40]:
df3.head()

,species,island,sex,BL_mm(0-1),BD_mm(0-1),FL_mm(0-1),BM_kg(0-1),species_ctg,island_ctg,binary_sex
0,Adelie,Torgersen,male,0.656040,0.869767,0.783550,0.595238,1,3,1
1,Adelie,Torgersen,female,0.662752,0.809302,0.805195,0.603175,1,3,-1
2,Adelie,Torgersen,female,0.676174,0.837209,0.844156,0.515873,1,3,-1
3,Adelie,Torgersen,female,0.615772,0.897674,0.835498,0.547619,1,3,-1
4,Adelie,Torgersen,male,0.659396,0.958140,0.822511,0.579365,1,3,1

In [41]:
second_column = df3.pop('species_ctg')
df3.insert(1, 'species_ctg', second_column)
fourth_column = df3.pop('island_ctg')
df3.insert(3, 'island_ctg', fourth_column)
nineth_column = df3.pop('sex')
df3.insert(8, 'sex', nineth_column)

In [42]:
df3.head()

,species,species_ctg,island,island_ctg,BL_mm(0-1),BD_mm(0-1),FL_mm(0-1),BM_kg(0-1),sex,binary_sex
0,Adelie,1,Torgersen,3,0.656040,0.869767,0.783550,0.595238,male,1
1,Adelie,1,Torgersen,3,0.662752,0.809302,0.805195,0.603175,female,-1
2,Adelie,1,Torgersen,3,0.676174,0.837209,0.844156,0.515873,female,-1
3,Adelie,1,Torgersen,3,0.615772,0.897674,0.835498,0.547619,female,-1
4,Adelie,1,Torgersen,3,0.659396,0.958140,0.822511,0.579365,male,1

In [43]:
df3_logR = df3.drop(['species','island','sex'], axis=1)
df3_logR.head()

,species_ctg,island_ctg,BL_mm(0-1),BD_mm(0-1),FL_mm(0-1),BM_kg(0-1),binary_sex
0,1,3,0.656040,0.869767,0.783550,0.595238,1
1,1,3,0.662752,0.809302,0.805195,0.603175,-1
2,1,3,0.676174,0.837209,0.844156,0.515873,-1
3,1,3,0.615772,0.897674,0.835498,0.547619,-1
4,1,3,0.659396,0.958140,0.822511,0.579365,1

In [44]:
df3_logR = df3_logR.sample(frac = 1) # This is how we shuffle the dataframe. This is very necessary
df3_logR.head()

,species_ctg,island_ctg,BL_mm(0-1),BD_mm(0-1),FL_mm(0-1),BM_kg(0-1),binary_sex
91,1,2,0.676174,0.860465,0.848485,0.690476,1
100,1,1,0.647651,0.800000,0.861472,0.595238,-1
324,3,2,0.765101,0.902326,0.839827,0.559524,-1
182,2,1,0.744966,0.804651,0.948052,0.833333,1
135,1,2,0.681208,0.800000,0.809524,0.551587,1

X = FEATURES

y = TARGET(i.e. "BINARY_SEX")

In [45]:
X = df3_logR.drop(['binary_sex'], axis=1)
y = df3_logR['binary_sex']

In [46]:
X.tail()

     species_ctg  island_ctg  BL_mm(0-1)  BD_mm(0-1)  FL_mm(0-1)  BM_kg(0-1)
174            2           1    0.838926    0.711628    0.952381    0.880952
250            2           1    0.895973    0.734884    0.948052    0.873016
270            3           2    0.758389    0.827907    0.857143    0.626984
203            2           1    0.724832    0.674419    0.900433    0.706349
307            3           2    0.854027    0.888372    0.848485    0.563492

In [47]:
X.shape

(333, 6)

In [48]:
y.tail()

174    1
250    1
270   -1
203   -1
307    1
Name: binary_sex, dtype: int64

In [49]:
y.shape

(333,)

CREATING TRAINING AND TESTING DATASETS (TRAINING = 80%, TESTING = 20%)

NOTE:- WE USE SLICING BELOW FOR TRAIN TEST SPLIT BECAUSE WE HAVE "SHUFFLED" OUR DATASET

In [50]:
X_train = X[0:267]
y_train = y[0:267]
X_test = X[267:]
y_test = y[267:]

print("X_train shape =", X_train.shape)
print("y_train shape =", y_train.shape)
print("X_test shape =", X_test.shape)
print("y_test shape =", y_test.shape)

X_train shape = (267, 6)
y_train shape = (267,)
X_test shape = (66, 6)
y_test shape = (66,)

WE CREATE A NUMERICAL MATRIX OUT OF EACH DATASETS BELOW FOR COMPUTATION IN LOGISTIC REGRESSION MODEL

In [51]:
X_train_matrix = X_train.values
y_train_matrix = y_train.values
X_test_matrix = X_test.values
y_test_matrix = y_test.values

print("X_train_matrix shape =", X_train_matrix.shape)
print("y_train_matrix shape =", y_train_matrix.shape)
print("X_test_matrix shape =", X_test_matrix.shape)
print("y_test_matrix shape =", y_test_matrix.shape)

X_train_matrix shape = (267, 6)
y_train_matrix shape = (267,)
X_test_matrix shape = (66, 6)
y_test_matrix shape = (66,)

NOW WE TAKE TRANSPOSE OF EACH MATRIX ABOVE TO SIMPLIFY OUR CALCULATIONS DURING THE MODEL DEVELOPMENT

In [52]:
X_train_matrix = X_train_matrix.T
y_train_matrix = y_train_matrix.reshape(1, X_train_matrix.shape[1])
X_test_matrix = X_test_matrix.T
y_test_matrix = y_test_matrix.reshape(1, X_test_matrix.shape[1])

print("X_train_matrix shape =", X_train_matrix.shape)
print("y_train_matrix shape =", y_train_matrix.shape)
print("X_test_matrix shape =", X_test_matrix.shape)
print("y_test_matrix shape =", y_test_matrix.shape)

X_train_matrix shape = (6, 267)
y_train_matrix shape = (1, 267)
X_test_matrix shape = (6, 66)
y_test_matrix shape = (1, 66)

# IMPLEMENTING LOGISTIC REGRESSION MODEL

In [53]:
class LogitRegression:
    def __init__(self):
        self.learning_rate = 1e-6
        self.iterations = 10000
        self.W = weights = np.zeros(6) # 6 zeros for 6 feature columns
        self.B = bias = 0
        
    def fit(self, X, y):
        N = X.shape[0]
        f = X.shape[1]
        cost_list = []
        for i in range(self.iterations):
            self.gradient_decent(X, y)
            c_val = self.cost(X, y)
            print(c_val)
        print("Weights = ",self.W)
        print("Bias = ",self.B)
        return cost_list
        
    def sigmoid(self, X):
        sigmoid = 1/(1 + np.exp(-X))
        return sigmoid
    
    def predict(self, X):
        products = np.dot(X, self.W) + self.B
        sig = self.sigmoid(products)
        
        if sig.all() >= 0.5:
            y_predicted = 1
        elif sig.all() < 0.5:
            y_predicted = 0
        return y_predicted
       
    def cost(self, X, y):
        N = X.shape[0]
        f = X.shape[1]
        products = np.dot(X, self.W) + self.B
        sig = self.sigmoid(products)
        
        logit_loss = (-1/N)*np.sum(y*np.log(sig)) + ((1-y)*np.log(1-sig))   
        return logit_loss

                        
    def gradient_decent(self, X, y):
        N = X.shape[0]
        f = X.shape[1]
                                   
        products = np.dot(X, self.W) + self.B
        sig = self.sigmoid(products)
                                   
        logit_gradient = (1/N)*(X.T)*(sig - y)
                                   
        delta = sig - y
        dW = np.dot(X.T, delta)/N
        dB = np.sum(delta)/N
        
        self.W = self.W - self.learning_rate*dW.T
        self.B = self.B - self.learning_rate*dB.T
    
    def accuracy(self, X, y):
        y_predicted = self.predict(X)
        acc = (np.sum(np.absolute(y - y_predicted))/y.shape[0])*100
        return acc

In [54]:
model = LogitRegression()

In [55]:
# cost_values = model.fit(X_train, y_train)
# cost_values.head()

In [56]:
print("Accuracy = ", model.accuracy(X_test, y_test))

Accuracy =  93.93939393939394

# REFERENCES

In [57]:
# CSE 574 Assignment 1
# https://www.geeksforgeeks.org/how-to-convert-pandas-dataframe-into-a-list/
# https://www.geeksforgeeks.org/how-to-drop-one-or-multiple-columns-in-pandas-dataframe/
# https://www.geeksforgeeks.org/how-to-move-a-column-to-first-position-in-pandas-dataframe/
# https://towardsdatascience.com/print-numpy-array-without-truncation-2d8fc97ca418
# https://www.geeksforgeeks.org/pandas-how-to-shuffle-a-dataframe-rows/
# Some PANDAS functions are known to me, learnt in EAS 595(Fall 2021)